---
kind: property
id: P:Autodesk.Revit.DB.AnnotationSymbol.AnnotationSymbolType
source: html/1745f100-2dca-c224-f978-8202d3c57a22.htm
---
# Autodesk.Revit.DB.AnnotationSymbol.AnnotationSymbolType Property

The AnnotationSymbol style of this AnnotationSymbol.

## Syntax (C#)
```csharp
public AnnotationSymbolType AnnotationSymbolType { get; set; }
```

## Remarks
The AnnotationSymbolType property can be used to retrieve the kind of the symbol.
This property can also be used to change the type of an annotation by setting it to a different type.
All the annotation symbol types in the project can be found using
the Document.AnnotationSymbolTypes property.